package com.insigma.dto;

import com.alibaba.druid.util.StringUtils;

/**
 * 操作日志类型,类型编码规则
 * 个人大写P+5位数字
 * 单位大写C+5位数字
 * 公共方法不记录日志
 */
public enum OpType {

    /************刘戴素**************************/
    P00000("P00000", "劳动者-注册个人手机账号"),
    P00001("P00001", "劳动者-获取手机号注册短信验证码"),
    P00002("P00002", "劳动者-获取手机号找回密码短信验证码"),
    P10000("P10000", "劳动者-注册个人账号"),
    P10001("P10001", "劳动者-登录个人账号"),
    P10002("P10002", "劳动者-创建个人名片"),
    P10003("P10003", "劳动者-修改个人基本信息"),
    P10004("P10004", "劳动者-上传个人头像"),
    P10005("P10005", "劳动者-新增简历求职意向"),
    P10006("P10006", "劳动者-修改简历求职意向"),
    P10007("P10007", "劳动者-新增简历工作经历"),
    P10008("P10008", "劳动者-修改简历工作经历"),
    P10009("P10009", "劳动者-删除简历工作经历"),
    P10010("P10010", "劳动者-新增简历教育经历"),
    P10011("P10011", "劳动者-修改简历教育经历"),
    P10012("P10012", "劳动者-删除简历教育经历"),
    P10013("P10013", "劳动者-新增简历语言能力"),
    P10014("P10014", "劳动者-修改简历语言能力"),
    P10015("P10015", "劳动者-删除简历语言能力"),
    P10016("P10016", "劳动者-修改简历自我描述"),
    P10017("P10017", "劳动者-新增简历附加信息"),
    P10018("P10018", "劳动者-修改简历附加信息"),
    P10019("P10019", "劳动者-刷新简历"),
    P10020("P10020", "劳动者-修改简历公开状态"),
    P10021("P10021", "劳动者-下载简历"),
    P10022("P10022", "劳动者-发送简历邮件"),

    /************麻鹏程**************************/
    P20000("P20000", "劳动者-"),


    /************王玉虎**************************/
    C10000("C10000", "用人单位-注册单位账号"),
    C10001("C10001", "用人单位-登录单位账号"),
    C10002("C10002", "用人单位-创建单位名片"),
    C10003("C10003","用人单位-修改单位基本信息"),
    C10004("C10004","用人单位-新增职位信息"),
    C10005("C10005","用人单位-修改职位信息"),
    C10006("C10006","用人单位-职位发布"),
    C10007("C10007","用人单位-职位下线"),
    C10008("C10008","用人单位-职位删除"),
    C10009("C10009","用人单位-职位删除恢复"),


    /************毛敏**************************/
    C20000("C20000","用人单位-查看简历"),
    C20001("C20001","用人单位-查看收到的简历"),
    C20002("C20002","用人单位-下载简历"),
    C20003("C20003","用人单位-收藏简历"),
    C20004("C20004","用人单位-取消收藏简历"),
    C20005("C20005","用人单位-发送面试邀请"),
    C20006("C20006","用人单位-登记面试反馈"),
    C20007("C20007","用人单位-修改面试反馈"),
    C20008("C20008","用人单位-申请招聘会"),
    C20009("C20009","用人单位-撤销申请招聘会"),
    C20010("C20010","用人单位-修改密码"),
    C20011("C20011","用人单位-新增子账号"),
    C20012("C20012","用人单位-修改子账号"),
    C20013("C20013","用人单位-删除子账号"),


    /************徐冀煜**************************/
    P30000("P30000", "劳动者-保存浏览职位记录"),
    P30001("P30001", "劳动者-投递简历"),
    P30002("P30002", "劳动者-收藏职位");

    private String code;
    private String name;

    OpType(String code, String name) {
        this.code = code;
        this.name = name;
    }

    public String getCode() {
        return code;
    }

    public void setCode(String code) {
        this.code = code;
    }

    public String getName() {
        return name;
    }

    public void setName(String name) {
        this.name = name;
    }

    public static OpType getSexEnumByCode(String code){
        for(OpType opType : OpType.values()){
            if(StringUtils.equals(code, opType.getCode())){
                return opType;
            }
        }
        return null;
    }
}
